---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PrimarySizeCriterion
source: html/a13d5027-cf55-0354-afd3-c56b5c8b41e9.htm
---
# PrimarySizeCriterion Members

Constructs a PrimarySizeCriterion with a minimum and maximum size.